---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarRefs
source: html/33cda288-fa40-572e-f4a2-e2ecbd557613.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTooFarRefs Property

Structural Connection Handler cannot connect too far elements

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionTooFarRefs { get; }
```